I think it's a issue of a clean install. I wasn't able to reproduce the error and crash.

```
 $ terraform --version
Terraform v0.13.0-beta3
+ provider registry.terraform.io/turbot/turbot v1.6.1

terraform {
  required_providers {
    turbot = {
      source = "turbot/turbot"
      version = "1.6.1"
    }
  }
}
resource "turbot_mod" "test" {
  org = "turbot"
  mod = "turbot-terraform-provider-test"
  version = "*"
}
```
```
 $ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_mod.test will be created
  + resource "turbot_mod" "test" {
      + id              = (known after apply)
      + mod             = "turbot-terraform-provider-test"
      + org             = "turbot"
      + parent          = "tmod:@turbot/turbot#/"
      + parent_akas     = (known after apply)
      + uri             = (known after apply)
      + version         = "*"
      + version_current = "5.0.2"
      + version_latest  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_mod.test: Creating...
turbot_mod.test: Creation complete after 9s [id=199077573124797]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
